app/controllers/dashboard_controller.rb

DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 54]]
SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."deleted_at" IS NULL AND "shortened_urls"."id" = $1 LIMIT 1  [["id", 5]]
---
  def destroy_shortened
    @url_id = params[:url_id]
    Shortener::ShortenedUrl.find(@url_id).destroy