app/controllers/home_controller.rb

SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."url" = $1  ORDER BY "shortened_urls"."id" ASC LIMIT 1  [["url", "http://aaaaaa.com/"]]
---
  def shorten
    long_url = params[:shorten][:url]
    uri = URI.parse(long_url)

    uri = "http://#{uri.to_s}" unless valid? uri
    unique_key = nil
    unique_key = Shortener::ShortenedUrl.generate(uri, owner: current_user).unique_key unless uri.to_s.blank?