app/controllers/orders_controller.rb

  def new
    order = Order.new
    long_url = params[:order][:url]
    unique_key = order.generate_unique(long_url, current_user)
    obj = Crawl::Flipkart::ProductData.new(long_url)
    product_attributes = obj.product_data
    total_price = order.calculate_total_price(product_attributes[:base_price], product_attributes[:weight], false)
    product_attributes.merge!(total_price: total_price, shorten_url: "#{root_url}#{unique_key}")
    @product = Product.create product_attributes.except(:weight, :img_url, :seller_name)
---
INSERT INTO "products" ("name", "base_price", "url", "total_price", "shorten_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"